Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: Truly I say to you, Wherever this good news goes out in all the world, what this woman has done will be talked of in memory of her.
chr: ᎤᏙᎯᏳᎯᏯ ᎯᎠ ᏂᏨᏪᏎᎭ; ᎠᎾᎵᏥᏙᏂᏙᎸᎭ ᎯᎠ ᎣᏍᏛ ᎧᏃᎮᏛ ᎢᎸᎯᏢ ᎡᎳᏂᎬᎢ, ᎾᏍᏉ ᎯᎠ ᎠᎨᏴ ᏥᎾᏛᎦ ᎤᏂᏃᎮᏗ ᎨᏎᏍᏗ, ᎾᏍᎩ ᎠᎦᏅᏓᏗᏍᏙᏗ.

source: Then one of the twelve, who was named Judas Iscariot, went to the chief priests and said,
chr: ᎿᏉᏃ ᎠᏏᏴᏫ ᏔᎳᏚ ᎢᏯᏂᏛ ᎨᏒᎢ, ᏧᏓᏏ ᎢᏍᎦᎳᏗ ᏧᏙᎢᏛ, ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ ᏫᏚᎷᏤᎴᎢ,

source: What will you give me, if I give him up to you? And the price was fixed at thirty bits of silver.
chr: ᎯᎠ ᏫᏂᏚᏪᏎᎴᎢ; ᎦᏙ ᏓᏍᎩᏁᎵ ᎠᏴᏃ ᏙᏓᏨᏲᎯᏎᎵ? ᏦᎠᏍᎪᎯᏃ ᎠᏰᎵ-ᎠᏕᎸ ᏕᎬᏩᏌᏍᏓᏁᎴᎢ.

source: And from that time he was watching for a chance to give him into their hands.
chr: ᎾᎯᏳᏉᏃ ᎤᎴᏅᎲᎩ ᎤᏲᎸ ᎢᏳᏛᏁᏗᏱ ᎤᎶᏄᎮᏗᏱ.

source: Now on the first day of unleavened bread the disciples came to Jesus, saying, Where are we to make ready for you to take the Passover meal?
chr: ᎢᎬᏱᏱᏉᏃ ᎢᎦ ᎾᎪᏔᏅᎾ ᎦᏚ ᎠᎩᏍᏗᏱ ᎨᏒ ᎬᏩᏍᏓᏩᏗᏙᎯ ᎬᏩᎷᏤᎸ ᏥᏌ, ᎯᎠ ᏂᎬᏩᏪᏎᎸᎩ, ᎭᏢ ᏣᏚᎵᎭ ᎣᎦᏛᏅᎢᏍᏙᏗᏱ ᏣᎵᏍᏓᏴᏗᏱ ᎧᏃᎯᏰᎩ.

source: And he said to them, Go into the town to such a man, and say to him, The Master says, My time is near: I will keep the Passover at your house with my disciples.
chr: ᎯᎠᏃ ᏄᏪᏒᎩ; ᎢᏤᎾ ᏗᎦᏚᎲᎢ, ᎾᎿ ᏤᎲ ᎠᏍᎦᏯ, ᎯᎠᏃ ᎾᏥᏪᏎᎸᎭ; ᏗᏕᏲᎲᏍᎩ ᎯᎠ ᏂᎦᏪᎭ; ᎿᏉ ᎠᎩᏍᏆᎸᎡᎵᏗ, ᎬᎩᏍᏓᏩᏗᏙᎯ ᎯᏁᎸ ᏓᏲᏥᏍᏆᏂᎪᏔᏂ ᎧᏃᎯᏰᎩ ᏗᎵᏍᏓᏴᏗᏱ ᎨᏒᎢ.

source: And the disciples did as Jesus had said to them; and they made ready the Passover.
chr: ᎬᏩᏍᏓᏩᏗᏙᎯᏃ ᏄᏍᏛ ᏥᏌ ᏚᏁᏤᎸ ᎾᏍᎩ ᏄᎾᏛᏁᎸᎩ, ᎠᎴ ᎣᏍᏛ ᏄᏅᏁᎸᎩ ᎧᏃᎯᏰᎩ ᏗᎵᏍᏓᏴᏗᏱ.

source: Now when evening was come, he was seated at table with the twelve disciples;
chr: ᎤᏒᏃ ᏄᎵᏍᏔᏅ ᎤᎾᏂᏢᏅᎩ [ᏥᏌ] ᏔᎳᏚ ᎢᏯᏂᏛ ᎬᏩᏍᏓᏩᏗᏙᎯ

source: And while they were taking food, he said, Truly I say to you that one of you will be false to me.
chr: ᎠᎾᎵᏍᏓᏴᎲᏍᎬᏃ ᎯᎠ ᏄᏪᏒᎩ; ᎤᏙᎯᏳᎯᏯ ᎯᎠ ᏂᏨᏪᏎᎭ; ᎯᎠ ᏥᏂᏣᏛᏅ ᏌᏉ ᎤᏓᏑᏯ ᏛᏆᏡᏔᏂ.

source: And they were very said, and said to him, one by one, Is it I, Lord?
chr: ᎤᏣᏘᏃ ᎤᏲᎢᏳ ᎤᏂᏰᎸᏅᎩ, ᎠᎴ ᎤᎾᎴᏅᎲᎩ ᎠᏂᏏᏴᏫᎭ ᎯᎠ ᏂᎬᏩᏪᏎᎸᎩ; ᏣᎬᏫᏳᎯ, ᏥᎪ ᎠᏴ?

source: And he made answer and said, He who puts his hand into the plate with me, the same will be false to me.
chr: ᎤᏁᏨᏃ ᎯᎠ ᏄᏪᏒᎩ; ᎢᏧᎳᎭ ᏦᏍᏓᏑᏫᏍᎦ ᎠᏖᎵᏙᎩᎯ ᎾᏍᎩ ᏛᏆᏡᏔᏂ.

source: The Son of man goes, even as the Writings say of him: but a curse is on that man through whom the Son of man is given up; it would have been well for that man if he had never come into the world.
chr: ᏴᏫ ᎤᏪᏥ ᎠᎢ ᏄᏍᏛ ᎪᏪᎵ ᎠᏥᏃᎮᏍᎬᎢ; ᎠᏎᏃ ᎤᏲᎢᏳ ᎢᏳᎵᏍᏓᏁᏗ ᎾᏍᎩ ᎠᏍᎦᏯ ᎠᏫ ᎤᏪᏥ ᎠᏡᏗᏍᎩ. ᎣᏏᏳ ᏱᎨᏎ ᎾᏍᎩ ᎠᏍᎦᏯ ᏄᏕᏅᎾᏉ ᏱᎨᏎᎢ.

source: And Judas, who was false to him, made answer and said, Is it I, Master? He says to him, Yes.
chr: ᏧᏓᏏᏃ ᎠᏓᏡᏗᏍᎩ ᎤᏁᏨ ᎯᎠ ᏄᏪᏒᎩ; ᏔᏕᏲᎲᏍᎩ, ᏥᎪ ᎠᏴ? ᎯᎠ ᏄᏪᏎᎸᎩ; ᏰᎵ ᏂᏫ.

source: And when they were taking food, Jesus took bread and, after blessing it, he gave the broken bread to the disciples and said, Take it; this is my body.
chr: ᎠᎾᎵᏍᏓᏴᎲᏍᎬᏃ ᏥᏌ ᎦᏚ ᎤᎩᏒᎩ, ᎠᎴ ᎤᎵᎮᎵᏨᎩ, ᎠᎴ ᎤᎬᎭᎷᏴᎩ, ᎠᎴ ᏚᏁᎸ ᎬᏩᏍᏓᏩᏗᏙᎯ, ᎯᎠᏃ ᏄᏪᏒᎩ; ᎢᏥᎩ, ᎢᏥᎦ, ᎯᎠ ᎾᏍᎩ ᎠᏴ ᏥᏰᎸᎢ.

source: And he took a cup and, having given praise, he gave it to them, saying,
chr: ᎤᎵᏍᏈᏗᏃ ᎤᎩᏒ ᎠᎴ ᎤᎵᎮᎵᏨ ᏚᏁᏁᎸᎩ, ᎯᎠ ᏄᏪᏒᎩ; ᏂᏥᎥ ᎢᏣᏗᏔ;

source: Take of it, all of you, for this is my blood of the testament, which is given for men for the forgiveness of sins.
chr: ᎾᏍᎩᏰᏃ ᎯᎠ ᎠᎩᎩᎬ ᎢᏤ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛᎢ, ᎾᏍᎩ ᎤᏂᏣᏘ ᏥᎨᎦᏤᏪᎸ, ᎦᎨᏥᏁᏗᏱ ᎤᏂᏍᎦᏅᏨᎢ.

source: But I say to you that from now I will not take of this fruit of the vine, till that day when I take it new with you in my Father's kingdom.
chr: ᎠᏎᏃ ᎯᎠ ᏂᏨᏪᏎᎭ; ᎥᏝ ᎢᎸᎯᏳ ᎪᎩ ᎢᏳᏓᎴᏅᏛ ᏴᎦᎦᏗᏔ ᎯᎠ ᏖᎸᎳᏗ ᎤᎾᏄᎪᏫᏒᎯ, ᎬᏂ ᎾᎯᏳ ᎢᎦ ᎢᏧᎳᎭ ᎢᏤ ᎢᏓᏗᏔᎲᎭ ᎡᏙᏓ ᎤᏤᎵᎪᎯ.

source: And after a song of praise to God, they went out to the Mountain of Olives.
chr: ᏚᏂᏃᎩᏒᏃ ᏗᎧᏃᎩᏍᏗ ᎤᏂᏄᎪᏨᎩ, ᎣᎵᏩᏲᎢ ᎤᏌᎯᎸ ᏭᏂᎶᏒᎩ.

source: Then said Jesus to them, All of you will be turned away from me this night: for it is said in the Writings, I will put to death the keeper of the sheep, and the sheep of the flock will be put to flight.
chr: ᎿᏉᏃ ᏥᏌ ᎯᎠ ᏂᏚᏪᏎᎸᎩ; ᏂᎯ ᏂᏥᎥ ᏙᏓᏦᏕᎵ ᎪᎯ ᏒᏃᏱ ᏥᎩ, ᎠᏴ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᏍᏗ. ᎯᎠᏰᏃ ᏂᎬᏅ ᎢᎪᏪᎳ, ᏓᏥᏴᏂᎵ ᎠᏫ-ᏗᎦᏘᏯ, ᎠᏫᏃ ᎤᎾᏓᏡᎬ ᏛᎾᏗᎦᎴᏲᏥ.

source: But after I am come back from the dead, I will go before you into Galilee.
chr: ᎠᏎᏃ ᏗᏆᎴᏅᎯ ᎨᏎᏍᏗ ᎢᎬᏱ ᏅᏓᏨᏰᏅᎡᎵ ᎨᎵᎵ.

source: But Peter made answer and said to him, Though all may be turned away from you, I will never be turned away.
chr: ᏈᏓ ᎤᏁᏨ ᎯᎠ ᏄᏪᏎᎸᎩ; ᎾᏍᏉ ᏂᎦᏛ ᏱᏚᏃᏕᎸ ᏂᎯ ᏱᏅᏗᎦᎵᏍᏙᏗᎭ, ᎠᏎ ᎠᏴ ᎥᏝ ᏱᏙᎬᏉᏕᎦ.

source: Jesus said to him, Truly I say to you that this night, before the hour of the cock's cry, you will say three times that you have no knowledge of me.
chr: ᏥᏌᏃ ᎯᎠ ᏄᏪᏎᎸᎩ; ᎤᏙᎯᏳᎯᏯ ᎯᎠ ᏂᎬᏪᏎᎭ; ᎪᎯᏉ ᏒᏃᏱ ᏥᎩ ᎠᏏ ᏣᏔᎦ ᎾᏂᏴᎬᎾ ᎨᏎᏍᏗ ᏦᎢ ᏅᏓᏍᏆᏓᏱᎵ.

source: Peter says to him, Even if I am put to death with you, I will not be false to you. So said all the disciples.
chr: ᏈᏓᏃ ᎯᎠ ᏄᏪᏎᎸᎩ; ᎾᏍᏉ ᎢᏧᎳᎭ ᏗᏱᏂᏲᎱᎯᏍᏗ ᏱᎩ, ᎠᏎ ᎥᏝ ᏴᎦᎬᏯᏓᏱᎦ. ᎾᏍᎩᏯ ᎾᏍᏉ ᏂᎦᏛ ᎬᏩᏍᏓᏩᏗᏙᎯ ᎾᏍᎩ ᏄᏂᏪᏒᎩ.

source: Then comes Jesus with them to a place named Gethsemane, and says to his disciples, Be seated here, while I go over there for prayer.
chr: ᎿᏉᏃ ᏥᏌ ᎠᎴ ᎬᏩᏍᏓᏩᏗᏙᎯ ᎤᏂᎷᏨᎩ ᎨᏏᎻᏂ ᏚᏙᎥᎢ, ᎯᎠᏃ ᏂᏚᏪᏎᎸ ᎬᏩᏍᏓᏩᏗᏙᎯ; ᎠᏂ ᎢᏥᏁᏍᏗ ᎬᏂ ᎢᏢ ᏫᎦᏓᏙᎵᏍᏔᏅᎭ.

source: And he took with him Peter and the two sons of Zebedee, and became sad and very troubled.
chr: ᏚᏘᏅᏒᎩᏃ ᏈᏓ ᎠᎴ ᎠᏂᏔᎵ ᏤᏈᏗ ᏧᏪᏥ, ᎠᎴ ᎤᎴᏅᎮ ᎡᎯᏍᏗ ᎤᏓᏅᏓᏕᎢ, ᎠᎴ ᎤᏣᏘ ᎦᎨᏗᏳ ᏄᎵᏍᏓᏁᎴ ᎤᏓᏅᏛᎢ.

source: Then says he to them, My soul is very sad, even to death: keep watch with me here.
chr: ᎿᏉᏃ ᎯᎠ ᏂᏚᏪᏎᎴᎢ; ᎠᏆᏓᏅᏛ ᎤᎧᎵᏨᎯ ᎤᏣᏘ ᎡᎯᏍᏗ ᎨᏒᎢ ᎠᏲᎱᎯᏍᏗ ᎨᏒ ᎢᎦᎢ. ᎠᏂ ᎢᏥᏁᏍᏗ ᎠᎴ ᎢᏧᎳᎭ ᎢᏗᏯᏫᏍᎨᏍᏗ.

source: And he went forward a little, and falling down on his face in prayer, he said, O my Father, if it is possible, let this cup go from me; but let not my pleasure, but yours be done.
chr: ᎤᏍᏗᎩᏛᏃ ᎤᏗᏗᏢᏍᏙᏗ ᎢᏴᏛ ᏭᎷᏤᎢ, ᎠᎴ ᎤᎵᏯᏍᏚᏁᎢ, ᎠᎴ ᎤᏓᏙᎵᏍᏔᏁᎢ, ᎯᎠ ᏄᏪᏎᎢ; ᎡᏙᏓ, ᎢᏳᏃ ᏰᎵ ᎢᎬᏩᎵᏍᏙᏗ ᎨᏎᏍᏗ ᏩᎩᎶᎯᏏᏉ ᎯᎠ ᎤᎵᏍᏈᏗ; ᎥᏝᏍᎩᏂᏃᏅ ᎠᏴ ᏄᏍᏛ ᎦᏓᏅᏖᏍᎬᎢ, ᏂᎯᏍᎩᏂ.

source: And he comes to the disciples, and sees that they are sleeping, and says to Peter, What, were you not able to keep watch with me one hour?
chr: ᎬᏩᏍᏓᏩᏗᏙᎯᏃ ᎠᏂᏅ ᏗᎤᎷᏨ ᏚᏩᏛᎮ ᎠᏂᎵᏁᎢ, ᎯᎠᏃ ᏄᏪᏎᎴ ᏈᏓ; ᎦᏙᏉ, ᏝᏍᎪ ᏥᏯᏫᏍᎬ ᏌᏉ ᎢᏳᏟᎶᏛ ᎢᎪᎯᏛ ᎨᏥᏯᏫᏍᏗ ᏱᎩ?

source: Keep watch with prayer, so that you may not be put to the test: the spirit truly is ready, but the flesh is feeble.
chr: ᎢᏥᏯᏫᏍᎨᏍᏗ ᎠᎴ ᎢᏣᏓᏙᎵᏍᏗᏍᎨᏍᏗ ᎾᏍᎩ ᎤᏓᎪᎵᏰᏗᏱ ᎨᏒ ᏫᏥᎾᏄᎪᎢᏍᏗᏱ ᏂᎨᏒᎾ ᎨᏒᎢ. ᎠᏓᏅᏙ ᎤᏙᎯᏳᎯ ᎤᏛᏅᎢᏍᏗ, ᎤᏇᏓᎸᏍᎩᏂ ᏩᎾᎦᎳᎯᏳ.

source: Again, a second time he went away, and said in prayer, O my Father, if this may not go from me without my taking it, let your pleasure be done.
chr: ᏔᎵᏁᏃ ᎤᏪᏅᏎᎢ, ᏭᏓᏙᎵᏍᏔᏁᎢ, ᎯᎠ ᏫᏄᏪᏎᎢ; ᎡᏙᏓ, ᎢᏳᏃ ᎯᎠ ᎤᎵᏍᏈᏗ ᎬᎩᎶᎯᏎᏗᏉ ᏂᎨᏒᎾ ᏱᎩ, ᎬᏂ ᏯᏆᏗᏔᎲ, ᏄᏍᏛ ᎭᏓᏅᏖᏍᎬ ᏫᏂᎦᎵᏍᏓ.

source: And he came again and saw them sleeping, for their eyes were tired.
chr: ᏗᎤᎷᏨᏃ ᏚᏩᏛᎮ ᏔᎵᏁ ᎠᏂᎵᎾᎡᎢ, ᏗᏂᎦᏙᎵᏰᏃ ᏗᎦᎨᏗᏳ ᎨᏎᎢ.

source: And he went away from them again, and a third time said the same prayer.
chr: ᏔᎵᏁᏃ ᏚᏮᏕᏤ ᎠᎴ ᎤᏓᏅᏎᎢ, ᎠᎴ ᏦᎢᏁ ᏭᏓᏙᎵᏍᏔᏁᎢ, ᎾᏍᎩᏯ ᏫᏄᏪᏎᎢ.

source: Then he comes to the disciples; and says to them, Go on sleeping now, and take your rest: for the hour is come, and the Son of man is given into the hands of evil men.
chr: ᎿᏉᏃ ᏗᎤᎷᏨ ᎬᏩᏍᏓᏩᏗᏙᎯ ᎠᏂᏅᎢ, ᎯᎠ ᏂᏚᏪᏎᎴᎢ; ᎿᏉ ᎢᏥᎵᏅᎩ ᎠᎴ ᎢᏥᏯᏪᏐᎸᎦ; ᎬᏂᏳᏉ ᎢᏳ ᎨᏒ ᎤᏍᏆᎸᎯᏗ, ᏴᏫᏃ ᎤᏪᏥ ᎠᎦᏡᏔᏅ ᎤᏂᏁᎫᏥᏛ ᏴᏫ ᏕᎨᏥᏲᎯᏎᎸ.

source: Up, let us be going: see, he who gives me up is near.
chr: ᏗᏣᎴᎲᎦ! ᎢᏓᎢᏎᏍᏗ! ᎬᏂᏳᏉ ᎠᏉ ᏓᏯᎢ ᎠᏆᏡᏗᏍᎩ.

source: And while he was still talking, Judas, one of the twelve, came, and with him a band armed with swords and sticks, from the chief priests and those in authority over the people.
chr: ᎠᏏᏉᏃ ᎦᏬᏂᏍᎬᎢ ᎬᏂᏳᏉ ᏧᏓᏏ ᎠᏏᏴᏫ ᏔᎳᏚ ᎢᏯᏂᏛ ᎨᏒ ᎤᎷᏨᎩ, ᎠᎴ ᏓᏘᏁᎲᎩ ᎤᏂᏣᏘ ᏴᏫ, ᎠᏰᎳᏍᏗ-ᏗᎦᏅᎯᏛ ᎠᎴ ᎠᏓ ᏗᏂᏁᎯ, ᏅᏓᎬᏂᏅᏏᏛ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸᎠᏁᎶᎯ ᏗᏂᎳᏫᎩ ᎠᏁᎲ ᏴᏫ.

source: Now the false one had given them a sign saying, The one to whom I give a kiss, that is he: take him.
chr: ᎤᏡᏗᏍᎩᏃ ᏧᏃᏁᎸᎯ ᎨᏎ ᎤᎾᏙᎴᎰᎯᏍᏙᏗ ᎯᎠ ᎢᏳᏪᏒᎯ ᎨᏎᎢ; ᎩᎶ ᏥᏯᏚᏣᎳᏅᎭ ᎾᏍᎩ ᎨᏎᏍᏗ, ᎠᏍᏓᏯ ᏕᏥᏂᏴᎲᎭ.

source: And straight away he came to Jesus and said, Master! and gave him a kiss.
chr: ᎤᎵᏍᏗᏳᏃ ᏥᏌ ᎦᏙᎬ ᎤᎷᏨᎩ, ᎯᎠ ᏄᏪᏒᎩ; ᏙᎯᏱ ᏕᎾᏓᎪᏩᏛ, ᏍᎩᎾᏝᎢ; ᎠᎴ ᎤᏚᏣᎳᏅᎩ.

source: And Jesus said to him, Friend, do that for which you have come. Then they came and put hands on Jesus, and took him.
chr: ᏥᏌᏃ ᎯᎠ ᏄᏪᏎᎸᎩ; ᎩᎾᎵᎢ, ᎦᏙᏃ ᎥᎯᎷᎩ. ᎿᏉᏃ ᎤᏂᎷᏨᎩ ᎠᎴ ᏕᎬᏩᏏᏔᏛᎩ ᏥᏌ, ᎬᏩᏂᏴᎲᎩ.

source: And one of those who were with Jesus put out his hand, and took out his sword and gave the servant of the high priest a blow, cutting off his ear.
chr: ᎠᎴ ᎬᏂᏳᏉ ᎠᏏᏴᏫ ᏥᏌ ᎠᏁᎯ ᎤᏌᎳᏓᏅᎩ ᎧᏃᎨᏂ ᎤᎸᎲᎩ ᎠᏰᎳᏍᏗ-ᎦᏅᎯᏛ, ᎠᎴ ᎤᎷᏴ ᎤᎬᏫᏳᎯ ᎠᏥᎸ-ᎨᎶᎯ ᎤᏅᏏᏓᏍᏗ, ᎠᎴ ᎤᎵᏍᏕᏍᏔᏅᎩ.

source: Then says Jesus to him, Put up your sword again into its place: for all those who take the sword will come to death by the sword.
chr: ᎿᏉᏃ ᏥᏌ ᎯᎠ ᏄᏪᏎᎸᎩ; ᎦᎳᏗᏍᏗᏱ ᏥᎯᎳᏓ ᏣᏤᎵ ᎠᏰᎳᏍᏗᎦᏅᎯᏛ, ᏂᎦᏛᏰᏃ ᎠᏰᎳᏍᏗ-ᎦᏅᎯᏛ ᎠᏂᏱᏍᎩ ᎠᏰᎳᏍᏗ-ᎦᏅᎯᏛ ᏧᏂᏲᎱᎯᏍᏙᏗ ᎨᏎᏍᏗ.

source: Does it not seem possible to you that if I make request to my Father he will even now send me an army of angels?
chr: ᏝᏍᎪ ᏯᏓᏅᏖᎭ ᏰᎵ ᎦᏥᏯᏓᏙᎵᏍᏓᏁᏗ ᎨᏒ ᎡᏙᏓ, ᎩᎳᏉᏃ ᎢᏴᏛ ᎥᏝ ᏔᎳᏚᏉ ᎢᏳᎾᏓᏡᎩ ᏗᏂᎧᎿᏩᏗᏙᎯ ᏱᏙᎬᎩᎧᏏ?

source: But how then would the Writings come true, which say that so it has to be?
chr: ᎠᏎᏃ ᎦᏙ ᏱᎦᎵᏍᏙᏓ ᏯᏙᎯᏳᎲᎦ ᏄᏍᏛ ᎪᏪᎸᎢ, ᎠᏎ ᎾᏍᎩ ᎢᏳᎵᏍᏙᏗ ᏥᎩ?

source: In that hour Jesus said to the people, Have you come out as against a thief with swords and sticks to take me? I was teaching every day in the Temple and you took me not.
chr: ᎾᎯᏳᏃ ᏥᏌ ᎯᎠ ᏂᏚᏪᏎᎸᎩ ᎤᏂᏣᏘ; ᏥᎪ ᎦᏃᏍᎩᏍᎩ ᏥᏥᏲᎰ ᎾᏍᎩᏯ ᎢᏥᎷᎩ ᏍᎩᏂᏴᎯᎦ, ᎠᏰᎳᏍᏗᏗᎦᏅᎯᏛ ᎠᎴ ᎠᏓ ᏗᏥᏁᎯ? ᏂᏚᎩᏨᏂᏒ ᎢᏧᎳᎭ ᎢᏗᏅᎩ ᏕᎦᏕᏲᎲᏍᎬᎩ ᎤᏛᎾ-ᏗᎦᎳᏫᎢᏍᏗᏱ, ᎥᏝᏃ ᏱᏍᎩᏂᏱᏍᎨᎢ.

source: But all this has taken place so that the writings of the prophets might come true. Then all his disciples went from him in flight.
chr: ᎠᏎᏃ ᏂᎦᏛ ᎾᏍᎩ ᎯᎠ ᏄᎵᏍᏔᏅᎩ ᎤᏙᎯᏳᏗᏱ ᎠᎾᏙᎴᎰᏍᎩ ᎤᏃᏪᎳᏅᎯ. ᎿᏉᏃ ᏂᎦᏛ ᎬᏩᏍᏓᏩᏗᏙᎯ ᎬᏩᏕᏨᎩ ᎠᎴ ᎤᎾᎵᏒᎩ.

source: And those who had made Jesus prisoner took him away to the house of Caiaphas, the high priest, where the scribes and those in authority over the people had come together.
chr: ᏥᏌᏃ ᎤᏂᏂᏴᏛ ᎧᏯᏉᎢ ᏭᎾᏘᏅᏍᏔᏅᎩ ᎾᏍᎩ ᏄᎬᏫᏳᏒ ᎠᏥᎸᎨᎶᎯ, ᎾᎿ ᏗᏃᏪᎵᏍᎩ ᎠᎴ ᏗᏂᎳᏫᎩ ᏓᏂᎳᏫᎥᎢ.

source: But Peter went after him at a distance, to the house of the high priest, and went in and took his seat with the servants, to see the end.
chr: ᏈᏓᏃ ᎤᏍᏓᏩᏛᏎ Ꭸ ᎢᏴᏛ ᏣᎢᏎ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᏗᎦᏁᎸ ᎬᏗᏍᎩ, ᎤᏴᎴᎢ, ᎠᎴ ᎨᏥᏅᏏᏓᏍᏗ ᎢᏧᎳᎭ ᎠᏂᏁᎢ, ᎤᎪᏩᏛᏗᏱ ᎤᏰᎸᏎ ᏩᎵᏍᏆᏗᎯᎲᎢ.

source: Now the chief priests and all the Sanhedrin were looking for false witness against Jesus, so that they might put him to death;
chr: ᏄᏂᎬᏫᏳᏒᏃ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎠᎴ ᏧᎾᏛᏐᏅᎯ ᎠᎴ ᏂᎦᏛ ᏗᏂᎳᏫᎩ ᎤᏂᏲᎴ ᎦᏰᎪᎩ ᎤᏂᏃᎮᎸᎯ ᏥᏌ ᎤᏡᏗᏍᎩ, ᎾᏍᎩ ᎤᏂᎯᏍᏗᏱ ᎤᎾᏚᎵᏍᎨᎢ;

source: And they were not able to get it, though a number of false witnesses came.
chr: ᎠᏎᏃ ᎤᎾᏠᏤᏉ; ᎤᏂᏣᏖᏍᎩᏂᏃᏅ ᎦᏰᎪᎩ ᎠᏂᏃᎮᏍᎩ ᎤᏂᎾᏄᎪᏤᎢ, ᎠᏎᏃ ᎤᎾᏠᏤᏉ. ᎣᏂᏱᏍᎩᏂᏃᏅ ᎠᏂᏔᎵ ᎦᏰᎪᎩ ᎠᏂᏃᎮᏍᎩ ᎤᏂᎷᏤᎢ, ᎯᎠ ᏄᏂᏪᏎᎢ;

source: But later there came two who said, This man said, I am able to give the Temple of God to destruction, and to put it up again in three days.
chr: ᎯᎠ ᏂᏚᏪᏒᎩ; ᏰᎵᏉ ᏱᏥᏲᏍᏓ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎤᏛᎾ-ᏗᎦᎳᏫᎢᏍᏗᏱ, ᏦᎢᏉᏃ ᏧᏙᏓᏆᏛ [ᏔᎵᏁ] ᏴᎦᏁᏍᎬᎵ.

source: And the high priest got up and said to him, Have you no answer? what is it which these say against you?
chr: ᏄᎬᏫᏳᏒᏃ ᎠᏥᎸ-ᎨᎶᎯ ᏚᎴᏁᎢ, ᎯᎠ ᏄᏪᏎᎴᎢ; ᏝᏍᎪ ᏱᏁᎦ? ᎦᏙ ᎯᎠ ᎠᏂᎦᏔᎲ ᏣᏂᏃᎮᎭ ᏥᎨᏣᏡᏗᎭ?

source: But Jesus said not a word. And the high priest said to him, I put you on oath, by the living God, that you will say to us if you are the Christ, the Son of God.
chr: ᎠᏎᏃ ᏥᏌ ᎡᎳᏪᏱᏉ ᎨᏎᎢ. ᏄᎬᏫᏳᏒᏃ ᎠᏥᎸ-ᎨᎶᎯ ᎢᎤᏁᏨ ᎯᎠ ᏄᏪᏎᎴᎢ; ᎬᎳᏲᏏ ᎤᏁᎳᏅᎯ ᎬᏂᏛ ᎯᏁᎢᏍᏙᏗᏱ, ᏍᎩᏃᎲᏏ, ᏥᎪ ᏂᎯ ᎦᎶᏁᏛ ᎤᏁᎳᏅᎯ ᎤᏪᏥ?

source: Jesus says to him, You say so: but I say to you, From now you will see the Son of man seated at the right hand of power, and coming on the clouds of heaven.
chr: ᏥᏌᏃ ᎯᎠ ᏄᏪᏎᎴᎢ; ᏰᎵ ᏂᏫ. ᎠᏎᏃ ᎯᎠ ᏂᏨᏪᏎᎭ; ᎢᎸᎯᏳ ᏓᏰᏥᎪᎢ ᏴᏫ ᎤᏪᏥ ᎠᎦᏘᏏ ᎢᏗᏢ ᎤᎵᏂᎬᎬ ᎤᏬᎴᏍᏗ, ᎠᎴ ᏣᎢᏎᏍᏗ ᎤᎶᎩᎸ ᎦᎸᎶᎢ.

source: Then the high priest, violently parting his robes, said, He has said evil against God: what more need have we of witnesses? for now his words against God have come to your ears:
chr: ᎿᏉᏃ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᏚᏄᏩᎥ ᏚᏪᏣᎦᎸᎮᎢ; ᎠᏐᏢᎢᏍᏓ, ᎤᏛᏁᎢ; ᎦᏙᏃ ᎠᏏ ᎠᏂᎦᏔᎯ ᏯᏂᏃᎮᎭ? ᎬᏂᏳᏉ ᎿᏉ ᎢᏣᏛᎬᎦ ᎠᏐᏢᎢᏍᏗᏍᎬᎢ.

source: What is your opinion? They made answer and said, It is right for him to be put to death.
chr: ᎦᏙ ᎢᏤᎵᎭ? ᎤᏂᏁᏨᏃ ᎯᎠ ᏄᏂᏪᏎᎢ; ᏰᎵᏉ ᎬᏩᏲᎱᎯᏍᏗ.

source: Then they put shame on him, and were cruel to him: and some gave him blows, saying,
chr: ᎿᏉᏃ ᎤᎧᏛ ᏚᎾᎵᏥᏍᏇᎢ, ᎠᎴ ᎠᏍᏈᏅ ᏕᎬᏩᎾᏍᏗᏍᎨᎢ ᎠᎴ ᎠᏂᏐᎢ ᏧᏃᏰᏂ ᏕᎬᏩᎾᏍᏗᏍᎨᎢ,

source: Be a prophet, O Christ, and say who gave you a blow!
chr: ᎯᎠ ᎾᏂᏪᏍᎨᎢ; ᏍᎩᏯᏙᎴᎣᎯᏏ, ᎦᎶᏁᏛ, ᎦᎪ ᏥᏨᏂᎦ?

source: Now Peter was seated in the open square outside the house: and a servant-girl came to him, saying, You were with Jesus the Galilaean.
chr: ᏈᏓᏃ ᎤᏬᎴ ᎤᏜᏅᏛᎢ, ᎤᎷᏤᎴᏃ ᎠᏛ ᎯᎠ ᏄᏪᏎᎢ; ᏂᎯ ᎾᏍᏉ ᏍᏕᏙᎲᎩ ᏥᏌ ᎨᎵᎵ ᎡᎯ.

source: But he said before them all that it was false, saying, I have no knowledge of what you say.
chr: ᎠᏎᏃ ᏂᎦᏛ ᎠᏂᎦᏔᎲ ᎤᏓᏱᎴᎢ, ᎯᎠ ᏄᏪᏎᎢ; ᎥᏝ ᏱᏥᎦᏔᎭ ᏂᏪᏍᎬᎢ.

source: And when he had gone out into the doorway, another saw him and says to those who were there, This man was with Jesus the Nazarene.
chr: ᏙᏱᏢᏃ ᏭᎶᏒ ᏅᏩᏓᎴ ᎤᎪᎮᎢ, ᎠᎴ ᎯᎠ ᏂᏚᏪᏎᎴ ᎾᎿ ᎠᏁᏙᎯ; ᎾᏍᏉ ᎯᎠ ᏥᏌ ᎾᏎᎵᏗ ᎡᎯ ᏓᏁᏙᎲᎩ.

source: And again he said with an oath, I have no knowledge of the man.
chr: ᏔᎵᏁᏃ ᎤᏓᏱᎴᎢ, ᎤᏁᎳᏅᎯ ᎤᏁᎢᏍᏔᏁᎢ; Ꮭ ᏱᏥᎦᏔᎭ Ꮎ ᎠᏍᎦᏯ, ᎤᏛᏁᎢ.

source: And after a little time those who were near came and said to Peter, Truly you are one of them; because your talk is witness against you.
chr: ᎪᎯᏱᏃ ᎢᏴᏛ ᎬᏩᎷᏤᎴ ᎾᎥ ᎠᏂᏙᎾᎢ, ᎯᎠ ᏂᎬᏩᏪᏎᎴ ᏈᏓ; ᎤᏙᎯᏳᎯ ᎾᏍᏉ ᏂᎯ ᎢᏤᏙᎸᎯ, ᎯᏬᏂᏍᎬᏰᏃ ᎬᏂᎨᏒ ᏂᏨᏁᎭ.

source: Then with curses and oaths he said, I have no knowledge of the man. And straight away there came the cry of a cock.
chr: ᎿᏉᏃ ᎤᎴᏅᎮ ᎤᏍᎩᏅᏕᎢ, ᎠᎴ ᎤᏁᎳᏅᎯ ᎤᏁᎢᏍᏔᏁᎢ; Ꮭ ᏱᏥᎦᏔᎭ Ꮎ ᎠᏍᎦᏯ, ᎤᏛᏁᎢ; ᎩᎳᏉᏃ ᎢᏴᏛ ᏣᏔᎦ ᎤᏴᎳᏎᎢ.

source: And the word of Jesus came back to Peter, when he said, Before the hour of the cock's cry, you will say three times that you have no knowledge of me. And he went out, weeping bitterly.
chr: ᏈᏓᏃ ᎤᏅᏓᏕ ᏥᏌ ᎤᏁᏨᎯ, ᎯᎠ ᏥᏄᏪᏎᎴᎢ; ᎠᏏ ᏣᏔᎦ ᎾᏂᏴᎬᎾ ᎨᏎᏍᏗ ᏦᎢ ᏅᏓᏍᏆᏓᏱᎵ. ᎤᏄᎪᏨᏃ ᎡᎯᏍᏗ ᏫᏚᏠᏱᎴᎢ.

source: Chapter 27
chr: ᎠᏯᏙᎸᎢ 27

source: Now when it was morning, all the chief priests and those in authority took thought together with the purpose of putting Jesus to death.
chr: ᏑᎾᎴᏃ ᏄᎵᏍᏔᏅ, ᏂᎦᏛ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎠᎴ ᏗᏂᎳᏫᎩ ᎠᏁᎲ ᎠᏫ ᎤᏂᏃᎮᎴ ᎢᏳᎾᏛᏁᏗᏱ ᏥᏌ ᎤᏂᎯᏍᏗᏱ.

source: And they put cords on him and took him away, and gave him up to Pilate, the ruler.
chr: ᎿᏉᏃ ᎤᎾᎸᎸ ᎤᏁᎵᏌᎾᏫᏛᎮᎢ, ᏆᏂᏛ ᏆᎴᏗ ᎤᎬᏫᏳᎯ ᏫᏚᏂᏲᎯᏎᎴᎢ.

source: Then Judas, who was false to him, seeing that he was to be put to death, in his regret took back the thirty bits of silver to the chief priests and those in authority,
chr: ᎿᏉᏃ ᏧᏓᏏ ᎾᏍᎩ ᎤᎶᏄᎮᎸᎯ ᎤᏙᎴᎰᏒ ᏓᎫᎪᏓᏁᎸᎢ ᎤᏁᏟᏴᏎ ᎤᏓᏅᏛᎢ, ᎠᎴ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎠᎴ ᏧᎾᏛᏐᏅᎯ ᏙᎤᏲᎮᎴ ᏦᎠᏍᎪᎯ ᎠᏰᎵ-ᎠᏕᎸ ᏧᎾᎬᏩᎶᏗ,

source: Saying, I have done wrong in giving into your hands an upright man. But they said, What is that to us? it is your business.
chr: ᎯᎠ ᏄᏪᏎᎢ; ᏥᏍᎦᏅᎩ ᏄᏍᎦᏅᏨᎾ ᎩᎬ ᏥᎦᏡᏓ. ᎯᎠᏃ ᏄᏂᏪᏎᎢ; ᎦᏙ ᎾᏍᎩ ᎠᏴ ᎣᎬᏙᏗ? ᏨᏒ ᎾᏍᎩ ᏗᏣᎸᏫᏍᏓᏏ.

source: And he put down the silver in the Temple and went out, and put himself to death by hanging.
chr: ᎠᎴ ᏚᏗᏅ ᎠᏕᎸ ᎾᎿ ᏗᎦᎳᏫᎢᏍᏗᏱ, ᎠᎴ ᎤᏄᎪᏤᎢ, ᎠᎴ ᎢᏴᏛ ᏭᎶᏒ, ᎤᏩᏒ ᏭᏓᏛᏁᎢ.

source: And the chief priests took the silver and said, It is not right to put it in the Temple store for it is the price of blood.
chr: ᏄᏂᎬᏫᏳᏒᏃ ᎠᏥᎸ-ᎠᏁᎶᎯ ᏚᏂᎩᏒ ᎠᏕᎸ ᎯᎠ ᏄᏂᏪᏎᎢ; ᎥᏝ ᏚᏳᎪᏛ ᏱᎦᎩ ᎠᏕᎸ-ᏗᏗᏱ ᏱᏗᏗᎲᏍᎦ, ᎩᎬᏰᏃ ᏧᎬᏩᎳᏅᎯ.

source: And they made a decision to get with the silver the potter's field, as a place for the dead of other countries.
chr: ᎤᏂᏃᎮᎸᏃ, ᎤᏂᏩᎯᏍᏔᏁ ᎥᏘ ᏗᎪᏢᏍᎩ ᎤᎶᎨᏒᎢ ᎾᎿ ᎠᏁᏙᎯ ᏗᎨᏥᏂᏐᏗᏱ.

source: For this cause that field was named, The field of blood, to this day.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎾᏍᎩ ᏠᎨᏏ ᎩᎬ ᎤᎶᎨᏒ ᎠᏃᏎᎭ ᎪᎯ ᏥᎩ.

source: Then came true that which was said by Jeremiah the prophet, And they took the thirty bits of silver, the price of him who was valued by the children of Israel;
chr: ᎿᏉᏃ ᎤᏙᎯᏳᏁ ᏧᏁᏤ ᏤᎵᎹᏯ ᎠᏙᎴᎰᏍᎩ, ᎯᎠ ᏥᏄᏪᏎᎢ; ᎠᎴ ᏚᏂᎩᏒᎩ ᏦᎠᏍᎪᎯ ᎠᏰᎵ-ᎠᏕᎸ ᎾᏍᎩ Ꮎ ᏧᎬᏩᏔᏅᎯ, ᎾᏍᎩ ᏣᏥᎬᏩᎶᏔᏅᎯ, ᎢᏏᎵ ᏧᏪᏥ ᏧᏂᎬᏩᎶᏔᏅᎯ,

source: And they gave them for the potter's field, as I had word from the Lord.
chr: ᎠᎴ ᎤᏂᏩᎯᏍᏔᏅᎩ ᎥᏘ ᏗᎪᏢᏍᎩ ᎤᎶᎨᏒᎢ, ᎾᏍᎩᏯ ᏱᎰᏩ ᎠᏇᏲᏅᎢ.

source: And Jesus was before the ruler, who put a question to him, Are you the King of the Jews? And Jesus said to him, You say so.
chr: ᏥᏌᏃ ᎦᏙᎨ ᎢᎬᏱᏗᏢ ᎤᎬᏫᏳᎯ ᎤᏬᎸᎢ. ᎤᎬᏫᏳᎯᏃ ᎤᏛᏛᏁᎢ, ᎯᎠ ᏄᏪᏎᎢ; ᏂᎯᏍᎪ ᏣᎬᏫᏳᎯ ᎠᏂᏧᏏ ᎤᎾᏤᎵᎦ? ᏥᏌᏃ ᎯᎠ ᏄᏪᏎᎴᎢ; ᏰᎵᏂᏫ.

source: But when the chief priests and those in authority made statements against him, he gave no answer.
chr: ᏄᏂᎬᏫᏳᏒᏃ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎠᎴ ᏗᏂᎳᏫᎩ ᎬᏩᏱᎵᏙᎸ ᎥᏝ ᏳᏁᏤᎢ.

source: Then says Pilate to him, Do you give no attention to what their witnesses say against you?
chr: ᎿᏉᏃ ᏆᎴᏗ ᎯᎠ ᏄᏪᏎᎴᎢ; ᏝᏍᎪ ᏯᏛᎩᎭ ᏂᎦᎥ ᎬᏂᎨᏒ ᎾᏅᏁᎲ ᎠᏂᎦᏔᎯ ᎨᏣᏡᏗᏍᎬᎢ?

source: And he gave him no answer, not even a word: so that the ruler was greatly surprised.
chr: ᎠᏎᏃ ᎥᏝ ᏌᏉᎤᏅ ᏱᏄᏁᏤᎢ, ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᎬᏫᏳᎯ ᎤᏣᏘ ᎤᏍᏆᏂᎪᏎᎢ.

source: Now at the feast it was the way for the ruler to let free to the people one prisoner, at their selection.
chr: ᏗᎵᏍᏓᏴᏗᏱᏃ ᎨᏒ ᎢᏳᎢ ᎤᎬᏫᏳᎯ ᏧᏲᎯᏎᏗ ᎨᏐ ᏌᏉ ᎠᏴᎩ, ᎯᎠᏉ ᎠᏁᎳ ᏴᏫ.

source: And they had then an important prisoner, whose name was Barabbas.
chr: ᎾᎯᏳᏃ ᏗᎦᏃᏣᎵ ᎠᏴᎩ ᎤᏂᎧᎮ ᏆᎳᏆ ᏧᏙᎢᏛ.

source: So when they came together, Pilate said to them, Whom will you have? Barabbas, or Jesus, who is named Christ?
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎿᏉ ᏚᏂᎳᏫᏨ ᏆᎴᏗ ᎯᎠ ᏂᏚᏪᏎᎴᎢ; ᎦᎪ ᎢᏣᏚᎵ ᏗᏨᏲᎯᏎᏗᏱ? ᏆᎳᏆᏍᎪ? ᏥᏌᎨ ᎦᎶᏁᏛ ᏣᏃᏎᎰᎢ?

source: For he saw that for envy they had given him up.
chr: ᎠᎦᏔᎮᏰᏃ ᎠᏅᏳᎬᏉ ᏅᏗᎦᎵᏍᏙᏗᏍᎬ ᏚᏂᏲᏒᎢ.

source: And while he was on the judge's seat, his wife sent to him, saying, Have nothing to do with that upright man, for I have had much trouble this day in a dream because of him.
chr: ᎤᏬᎸᏃ ᏗᎫᎪᏙᏗᏱ ᎦᏍᎩᎸᎢ ᎤᏓᎵᎢ ᏧᏓᏅᏎᎢ, ᎯᎠ ᏅᏧᏪᏎᎴᎢ; ᏞᏍᏗ ᏂᎯ ᎪᎱᏍᏗ Ꮎ ᎾᏍᎦᏅᎾ ᎠᏍᎦᏯ ᎤᎬᏩᎵ ᏱᏗᏣᎸᏫᏍᏓᏁᎴᏍᏗ, ᎤᏣᏘᏰᏃ ᏥᎩᎵᏲᎩ ᎪᎯ ᎢᎦ ᎦᏍᎩᏓᏍᎬᎢ ᎾᏍᎩ ᏅᏗᎦᎵᏍᏙᏗᏍᎬᎢ.

source: Now the chief priests and those in authority got the people to make request for Barabbas, and for Jesus to be put to death.
chr: ᎠᏎᏃ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎠᎴ ᏗᏂᎳᏫᎩ ᏚᏂᏍᏗᏰᏔᏁ ᎤᏂᏣᏘ ᎨᏒ ᏆᎳᏆ ᎤᏂᏔᏲᏎᏗᏱ, ᏥᏌᏃ ᎤᏂᎯᏍᏗᏱ.

source: But the ruler made answer and said to them, Which of the two is it your pleasure that I let go free? And they said, Barabbas.
chr: ᎤᎬᏫᏳᎯᏃ ᎤᏁᏨ ᎯᎠ ᏂᏚᏪᏎᎴᎢ; ᎦᎪ ᎯᎠ ᎠᏂᏔᎵ ᎨᏒ ᎢᏣᏚᎵ ᏗᏨᏲᎯᏎᏗᏱ? ᏆᎳᏆ, ᎤᎾᏛᏁᎢ.

source: Pilate says to them, What, then, am I to do with Jesus, who is named Christ? They all say, Let him be put to death on the cross.
chr: ᏆᎴᏗ ᎯᎠ ᏂᏚᏪᏎᎴᎢ; ᎦᏙᏃ ᏓᏥᏴᏁᎵ ᏥᏌ, ᎦᎶᏁᏛ ᏣᏃᏎᎰᎢ? ᏩᎦᏛᎥᎦ, ᎬᏬᏎᎴ ᏂᎦᏛ.

source: And he said, Why, what evil has he done? But they gave loud cries, saying, To the cross with him!
chr: ᎤᎬᏫᏳᎯᏃ ᎯᎠ ᏄᏪᏎᎢ; ᎦᏙᏃ, ᎦᏙ ᎤᏛᏁᎸ ᎤᏍᎦᏅᏨ? ᎠᏎᏃ ᎤᏟᏉ ᏂᎦᎡ ᎤᏁᎷᏁᎢ, ᏩᎦᏛᎥᎦ, ᎠᎾᏗᏍᎬᎢ.

source: So when Pilate saw that he was able to do nothing, but that trouble was working up, he took water and, washing his hands before the people, said, The blood of this upright man is not on my hands: you are responsible.
chr: ᏆᎴᏗ ᎤᏙᎴᎰᏒ ᏗᎬᏩᏎᎪᎩᏍᏗ ᏂᎨᏒᎾ ᎨᏒᎢ, ᎠᎴ ᎤᎾᏓᏑᏰᏛ ᎤᎾᎵᏔᎸᏅᎩ, ᎠᎹ ᏬᏁᎩᏎᎢ, ᎠᎴ ᏚᏑᎴᎮ ᎤᏂᏣᏘ ᎠᏂᎦᏔᎲᎢ, ᎯᎠ ᏄᏪᏎᎢ; ᎠᏴ ᎥᏝ ᎠᎩᏍᎦᏅᏨᎯ ᏱᎩ ᎯᎠ ᏄᏍᎦᏅᏨᎾ ᏴᏫ ᎤᎩᎬ. ᏂᎯ ᎢᏣᎦᏌᏯᏍᏓ.

source: And all the people made answer and said, Let his blood be on us, and on our children.
chr: ᏂᎦᏛᏃ ᏴᏫ ᎤᏂᏁᏤᎢ, ᎯᎠ ᏄᏂᏪᏎᎢ; ᎤᎩᎬ ᎠᏴ ᎠᎴ ᏦᎨᏥ ᎣᎩᏅᎦᎴᏍᏗ.

source: Then he let Barabbas go free: but after having Jesus whipped, he gave him up to be put to death on the cross.
chr: ᎿᏉᏃ ᏆᎳᏆ ᏕᎤᏲᎯᏎᎴᎢ; ᎤᎵᎥᏃᏅᏃ ᏥᏌ ᏚᏲᏎ ᎠᎦᏛᏗᏱ.

source: Then the ruler's armed men took Jesus into the open square, and got all their band together.
chr: ᎿᏉᏃ ᎠᏂᏯᏫᏍᎩ ᎤᎬᏫᏳᎯ ᏧᏤᎵᎦ ᎤᎬᏫᏳᎯ ᎦᏁᎸ ᎤᏂᏴᏔᏁ ᏥᏌ, ᎠᎴ ᎾᎿ ᏕᎬᏩᏚᏫᏍᏔᏁ ᏂᎦᏛ ᏑᎾᏓᏡᎩ ᎠᏂᏯᏫᏍᎩ.

source: And they took off his clothing, and put on him a red robe.
chr: ᏚᏂᏄᏪᏒᏃ, ᎩᎦᎨ ᎦᏌᎴᎾ ᎤᏂᏄᏬᎡᎢ.

source: And they made a crown of thorns and put it on his head, and put a rod in his right hand, and they went down on their knees before him, and made sport of him, saying, Long life to the King of the Jews.
chr: ᎠᎴ ᎤᏂᏍᏕᏲᏅ ᎠᎵᏍᏚᎶ ᏧᏣᏲᏍᏗ ᎪᏢᏔᏅᎯ, ᎤᏂᏍᏚᎳᏁᎢ, ᎠᎴ ᎦᎾᏍᏓ ᎠᎦᏘᏏ ᎢᏗᏢ ᎤᎾᏒᎦᎳᏗᏍᏔᏁᎢ; ᎠᎴ ᏓᎾᎵᏂᏆᏅᏁᎮ ᎠᎴ ᎠᎾᏕᎰᏗᏍᎨᎢ, ᎯᎠ ᎾᏂᏪᏍᎨᎢ; ᎢᏨᏲᎵᎦ, ᏣᎬᏫᏳᎯ ᎠᏂᏧᏏ ᎤᎾᏤᎵᎦ.

source: And they put shame on him, and gave him blows on the head with the rod.
chr: ᏚᎾᎵᏥᏇᏃ ᎠᎴ ᎤᏂᏴᎡᎴ ᎦᎾᏍᏓ ᎠᎴ ᎤᏂᏍᏆᎸᏂᏍᏔᏁᎢ.

source: And when they had made sport of him, they took the robe off him, and put his clothing on him, and took him away to put him on the cross.
chr: ᎤᎾᏕᎰᏔᏃᏅᏃ ᎤᏂᏄᏪᏎ ᎦᏌᎴᎾ, ᎠᎴ ᎤᏩᏒ ᏧᏄᏪ ᏚᏂᏄᏬᎡᎢ; ᎠᎴ ᎤᎾᏛᏗᏱ ᏭᎾᏘᏅᏍᏔᏁᎢ.

source: And while they were coming out, they saw a man of Cyrene, Simon by name, and they made him go with them, so that he might take up his cross.
chr: ᎤᏂᏄᎪᏨᏃ ᎤᏂᏩᏛᎮ ᎠᏍᎦᏯ ᏌᎵᏂ ᎡᎯ ᏌᏩᏂ ᏧᏙᎢᏛ; ᎾᏍᎩ ᎬᏍᎦᎢᏍᏓᎩ ᏄᏅᏁᎴ ᎤᏪᏅᏍᏗᏱ ᏧᏓᎿᏩᏛ.

source: And when they came to the place named Golgotha, that is to say, Dead Man's Head,
chr: ᏭᏂᎷᏨᏃ ᎪᎵᎦᏓ ᏚᏙᎥᎢ, ᎾᏍᎩ ᎤᏍᏆᎷᎪᎢ ᏥᎦᏛᎦ,

source: They gave him wine mixed with bitter drink: and after tasting it, he took no more.
chr: ᏧᏂᏦᏯᏍᏗ ᎤᏗᏔᏍᏗ ᎠᏓᎦ ᎠᏑᏱ ᎤᏂᏁᏁᎴᎢ, ᎤᏁᎸᏔᏅᏃ ᎥᏝ ᏳᏚᎸᎮ ᎤᏗᏔᏍᏗᏱ.

source: And when they had put him on the cross, they made division of his clothing among them by the decision of chance.
chr: ᎤᎾᏛᏁᏃ ᎠᎴ ᏚᏂᏯᏙᎴ ᏧᏄᏬ ᎠᎾᏌᏍᏗᏍᎨᎢ; ᎾᏍᎩᏃ ᎤᏙᎯᏳᏁ ᎠᏙᎴᎰᏍᎩ ᏧᏁᏤᎢ, ᎯᎠ ᏥᏄᏪᏎᎢ; ᏗᏆᏄᏬ ᏚᏂᏯᏙᎸᎩ, ᎠᎴ ᎠᏆᏄᏬ ᎤᎾᏌᏍᏔᏅᎩ.

source: And they were seated there watching him.
chr: ᎤᎾᏅᏁᏃ ᎠᎴ ᎤᏂᏯᏫᏎ.

source: And they put up over his head the statement of his crime in writing, THIS IS JESUS THE KING OF THE JEWS.
chr: ᎤᏂᏯᎸᏁᏃ ᎦᎸᎳᏗᏢ ᎤᎵᏍᏓᏛᎢ ᎢᏳᏍᏗ ᎨᏒ ᎤᎵᏱᎵᏕᎲᎢ, ᎯᎠ ᏂᎬᏁ ᎪᏪᎴᎢ; ᎯᎠᏲ ᏥᏌ ᎤᎬᏫᏳᎯ ᎠᏂᏧᏏ ᎤᎾᏤᎵᎦ.

source: Then two thieves were put on crosses with him, one on the right and one on the left.
chr: ᎾᏍᏉᏃ ᎢᏧᎳᎭ ᏕᎨᎦᏛᏁ ᎠᏂᏔᎵ ᎠᏂᏃᏍᎩᏍᎩ, ᏌᏉ ᎠᎦᏘᏏ ᎢᏗᏢ, ᏐᎢᏃ ᎠᎦᏍᎦᏂ ᎢᏗᏢ.

source: And those who went by said bitter words to him, shaking their heads and saying,
chr: ᎾᎥᏃ ᎠᏂᎶᏍᎩ ᎦᎬᏩᏐᏢᏕᎢ, ᎠᎴ ᏓᎾᎵᏍᏛᏁᎮᎢ,

source: You who would give the Temple to destruction and put it up again in three days, get yourself free: if you are the Son of God, come down from the cross.
chr: ᎯᎠ ᎾᏂᏪᏍᎨᎢ; ᎤᏛᎾ-ᏗᎦᎳᏫᎢᏍᏗᏱ ᎯᏲᏍᏗᏍᎩ, ᏦᎢᏉᏃ ᎢᎦ ᎯᏰᎢᎵᏙᎯ ᎭᏁᏍᎨᏍᎩ, ᎭᎵᏍᏕᎸ ᏨᏒ; ᎢᏳᏃ ᏂᎯ ᎤᏁᎳᏅᎯ ᎤᏪᏥ ᎨᏎᏍᏗ, ᏓᏓᎿᏩᏍᏛ ᎡᎭᏠᎠᎯ.

source: In the same way, the chief priests, making sport of him, with the scribes and those in authority, said,
chr: ᎾᏍᏉᏃ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸᎠᏁᎶᎯ ᎠᎴ ᏗᏃᏪᎵᏍᎩ ᎠᎴ ᏗᏂᎳᏫᎩ ᎠᏂᏰᎵᏍᎬᎢ ᎯᎠ ᎾᏂᏪᏍᎨᎢ;

source: A saviour of others, he has no salvation for himself. If he is the King of Israel, let him now come down from the cross, and we will have faith in him.
chr: ᎠᏂᏐᎢ ᏓᏍᏕᎵᏍᎬᎩ, ᎤᏩᏒᏍᎩᏂ ᎥᏝ ᏴᎬᎵᏍᏕᎸ. ᎢᏳᏃ ᎤᎬᏫᏳᎯ ᎢᏏᎵ ᎤᎾᏤᎵ ᎨᏎᏍᏗ, ᎿᏉ ᏓᏓᎿᏩᏍᏛ ᎡᎠᏠᎠᎯ, ᎩᎳᏃ ᏓᏰᏙᎢᏳᏂ.

source: He put his faith in God; let God be his saviour now, if he will have him; for he said, I am the Son of God.
chr: ᎤᏁᎳᏅᎯ ᎤᎵᏍᎦᏍᏙᏛᎩ; ᎿᏉ ᏭᏍᏕᎸ ᎢᏳᏃ ᎤᎸᏉᏕᏍᏗ; ᎯᎠᏰᏃ ᏥᏂᎦᏪᏍᎬᎩ, ᎤᏁᎳᏅᎯ ᎡᏙᏓ.

source: And the thieves who were on the crosses said evil words to him.
chr: ᎠᏂᏃᏍᎩᏍᎩᏃ ᎾᏍᎩ ᎢᏧᎳᎭ ᏗᎨᎦᏛᏅᎯ ᎾᏍᏉ ᎦᎬᏩᏐᏢᏕᎢ.

source: Now from the sixth hour it was dark over all the land till the ninth hour.
chr: ᎿᏉᏃ ᎢᎦ ᎤᏓᎴᏅᏛ ᏦᎢᏁ ᎢᏳᏟᎶᏛ ᎧᎳᏩᏗᏒ ᎢᏯᏍᏘ ᎤᏒᎯᏰᏱ ᎢᏗᏢ ᎤᎵᏏᎲᏒᎩ ᏂᎬ ᎾᏍᎩ ᎦᏙᎯ.

source: And about the ninth hour Jesus gave a loud cry, saying, Eli, Eli, lama sabachthani? that is, My God, my God, why are you turned away from me?
chr: ᏦᎢᏁᏃ ᎢᏳᏟᎶᏛ ᎢᏴ ᎧᏔᏩᏗᏒ ᎤᏒᎯᏰᏱ ᎢᏗᏢ ᏥᏌ ᎤᏁᏤ ᎠᏍᏓᏯ, ᎯᎠ ᏄᏪᏎᎢ; ᎢᎳ, ᎢᎳ, ᎳᎹ ᏌᏆᏓᏂ? ᎾᏍᎩ ᎯᎠ ᏄᏍᏗ ᎦᏛᎬᎢ, ᎤᏁᎳᏅᎯ ᎠᏆᏤᎵᎦ, ᎤᏁᎳᏅᎯ ᎠᏆᏤᎵᎦ, ᎦᏙᏃ ᎢᏍᏋᏕᏨᏉ?

source: And some of those who were near by, hearing it, said, This man is crying to Elijah.
chr: ᎢᎦᏛᏃ ᎾᎿ ᎠᏂᏙᎾᎢ ᎾᏍᎩ ᎤᎾᏛᎦᏅ, ᎢᎳᏯ ᎠᏯᏂᎭ ᎯᎠ, ᎤᎾᏛᏁᎢ.

source: And straight away one of them went quickly, and took a sponge, and made it full of bitter wine, and put it on a rod and gave him drink.
chr: ᎩᎳᏉᏃ ᎢᏴᏛ ᎠᏏᏴᏫ ᏚᏍᏆᎸᏔᏁᎢ, ᎠᎴ ᏭᏁᏎ ᏚᏬᎵ, ᎠᎴ ᏧᏂᏦᏯᏍᏗ ᎤᎧᎵᎢᏍᏔᏁᎢ, ᎦᎾᏍᏙᎯᏃ ᎤᏪᏆᏙᏔᏅ ᏭᏅᏁᎴ ᎾᏍᎩ ᎤᏗᏔᏍᏗ.

source: And the rest said, Let him be; let us see if Elijah will come to his help.
chr: ᎢᎦᏛᏃ ᎯᎠ ᏄᏂᏪᏎᎢ; ᎤᏁᎳᎩ, ᎢᏓᏙᎴᎰᎯ, ᏥᎪᏃ ᎢᎳᏯ ᏓᎦᎷᏥ ᏓᏳᏍᏕᎸᎯᎵ.

source: And Jesus gave another loud cry, and gave up his spirit.
chr: ᏥᏌᏃ ᏔᎵᏁ ᎠᏍᏓᏯ ᎤᏁᏨ ᏕᎤᏲᏎ ᎤᏓᏅᏙ.

source: And the curtain of the Temple was parted in two from end to end; and there was an earth-shock; and the rocks were broken;
chr: ᎬᏂᏳᏉᏃ ᎠᏄᏬ ᎠᏰᏙᎳᏛ ᎤᏛᎾ-ᏗᎦᎳᏫᎢᏍᏗᏱ ᏚᎵᏍᏡᏰᎢ, ᎦᎸᎳᏗ ᏧᎴᏅᎮ ᎡᎳᏗ ᏭᏍᏆᏗᏍᏔᏁᎢ; ᎠᎴ ᎦᏙᎯ ᎤᎵᏖᎸᏁᎢ, ᎠᎴ ᏅᏯ ᏚᎾᎵᏍᏡᏰᎢ.

source: And the resting-places of the dead came open; and the bodies of a number of sleeping saints came to life;
chr: ᏓᏤᎵᏍᏛᏃ ᏚᎵᏍᏚᎢᏎᎢ, ᎠᎴ ᎤᏂᏣᏘ ᎤᎾᏓᏅᏘ ᎤᏂᎵᏅᏨᎯ ᎤᎾᏗᏓᏁᏎᎢ,

source: And coming out of their resting-places, after he had come again from the dead, they went into the holy town and were seen by a number of people.
chr: ᎠᎴ ᏓᏤᎵᏍᏛ ᏚᏂᏄᎪᏤ ᏧᎴᏅᎯ ᏂᎨᏎᎢ, ᎠᎴ ᎦᎸᏉᏗᏳ ᎦᏚᎲ ᎤᏂᏴᎴᎢ, ᎠᎴ ᎤᏂᏣᏖ ᎬᏂᎨᏒ ᏂᏚᎾᏛᏁᎴᎢ.

source: Now the captain and those who were with him watching Jesus, when they saw the earth-shock and the things which were done, were in great fear and said, Truly this was a son of God.
chr: ᎿᏉᏃ ᎠᏍᎪᎯᏧᏈ ᏗᏓᏘᏂᏙᎯ ᎠᎴ ᎾᏍᎩ Ꮎ ᎢᏧᎳᎭ ᏥᏌ ᎬᏩᏯᏫᏍᎩ, ᎤᎾᏙᎴᎰᏒ ᎦᏙᎯ ᎠᎵᏖᎸᎲᏍᎬᎢ, ᎠᎴ ᎾᏍᎩ ᏄᎵᏍᏔᏂᏙᎸᎢ, ᎤᏣᏖ ᎤᏂᏍᎦᎴᎢ, ᎯᎠ ᏄᏂᏪᏎᎢ; ᎤᏙᎯᏳᎯᏯ ᎤᏁᎳᏅᎯ ᎤᏪᏥ ᎨᏎ ᎯᎠ.

source: And a number of women were there, watching from a distance, who had come with Jesus from Galilee, waiting on his needs.
chr: ᎾᎿᏃ ᎠᏂᏙᎾᎡ ᎤᏂᏣᏖ ᎠᏂᎨᏴ Ꭸ ᎢᏴᏛ ᏙᏗᏂᎧᏁᎢ, ᎾᏍᎩ ᏥᏌ ᎨᎵᎵ ᏅᏓᎬᏩᏍᏓᏩᏛᏛ ᎬᏩᏍᏕᎸᎯᏙᎸᎯ,

source: Among whom was Mary Magdalene, and Mary, the mother of James and Joses, and the mother of the sons of Zebedee.
chr: ᎾᎿ ᎤᎾᏓᏑᏰ ᎺᎵ ᎹᎩᏕᎵ ᎡᎯ, ᎠᎴ ᎺᎵ ᏥᎻ ᎠᎴ ᏦᏏ ᎤᏂᏥ, ᎠᎴ ᏤᏈᏗ ᏧᏪᏥ ᎤᏂᏥ.

source: And in the evening, there came a man of wealth from Arimathaea, Joseph by name, who was a disciple of Jesus:
chr: ᎤᏒᏃ ᏄᎵᏍᏔᏅ ᎤᎷᏤ ᎤᏪᎿᎢ ᎠᏍᎦᏯ ᎠᎵᎹᏗᏱ ᎡᎯ ᏦᏩ ᏧᏙᎢᏛ, ᎾᏍᏉ ᎾᏍᎩ ᏥᏌ ᎤᏍᏓᏩᏗᏙᎯ ᎨᏎᎢ;
